src/cf/InformationRegisters/УпаковкиМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УпаковкиМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерГрупповойУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.SSCC</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрупповаяУпаковка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВложеныПотребительскиеУпаковки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходнаяЗонаТаможенногоКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныТаможенногоКонтроляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсходныйДокументРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗонаТаможенногоКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныТаможенногоКонтроляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДолиУпаковокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДолиУпаковокМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДоляУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыУпаковокМДЛП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ОрганизацииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОрганизацииМДЛП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомерУчастника</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторСубъектаОбращенияОбщийМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственнаяОрганизация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияСхемОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекретКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАутентификации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАутентификацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ор_МДЛПУпаковкиМаркируемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ор_МДЛПУпаковкиМаркируемыхТоваров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ор_МДЛПЗагрузитьНомераУпаковок30/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаВыборФайла;
	Элементы.ФормаДалее.Видимость = Истина;
	Элементы.ФормаЗагрузить.Видимость = Ложь;
	
	Элементы.Декорация2.Видимость = ЕстьЗаписиУпаковок();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = НСтр("ru='Выберите файл с данными упаковок'");
	Диалог.ПолноеИмяФайла = "";
	Диалог.МножественныйВыбор = Ложь;
	
	ДополнительныеПараметры = Новый Структура;
	Оповещение = Новый ОписаниеОповещения("ПоказатьДиалогВыбораФайлаЗавершение", ЭтотОбъект);
	
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если НЕ ЗначениеЗаполнено(ИмяФайла) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не выбран файл.'"));
		Возврат;
	КонецЕсли;
	
	ПрочитатьФайл();
	
	Если НомераУпаковок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Файл не содержит данные выгрузки.'"));
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЗагрузка;
	Элементы.ФормаДалее.Видимость = Ложь;
	Элементы.ФормаЗагрузить.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНомераУпаковок(Команда)
	
	ЕстьОшибки = Ложь;
	Для Каждого Строка Из НомераУпаковок Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.МестоДеятельности) Тогда
			ТекстСообщения = НСтр("ru='У номера упаковки %НомерУпаковки% не заполнено место деятельности'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерУпаковки%", Строка.НомерУпаковки);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
			ЕстьОшибки = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьЗаписиУпаковок() Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПоказатьВопросПредупрежденияЗавершение", ЭтотОбъект);
		
		ТекстВопроса = НСтр("ru = 'Регистры сведений ""Упаковки МДЛП"" и ""Доли упаковок МДЛП"" будут очищены. Продолжить?.'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Возврат;
		
	КонецЕсли;
	
	ЗагрузитьНомераУпаковокСервер();
	
	ТекстСообщения = НСтр("ru='Загрузка завершена.'");
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьДиалогВыбораФайлаЗавершение(ВыбранныеФайлы, ДополнительныеДанные) Экспорт
	
	Если (ТипЗнч(ВыбранныеФайлы) = Тип("Массив"))
			И (ВыбранныеФайлы.Количество() > 0) Тогда
		ИмяФайла = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВопросПредупрежденияЗавершение(РезультатВопроса, ДополнительныеДанные) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ЗагрузитьНомераУпаковокСервер();
		
		ТекстСообщения = НСтр("ru='Загрузка завершена.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьФайл()
	
	ФайлДанныхУпаковок = Новый ТекстовыйДокумент;
	ФайлДанныхУпаковок.Прочитать(ИмяФайла);
	ПрочитатьФайлСервер(ФайлДанныхУпаковок.ПолучитьТекст());
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлСервер(ТекстФайла)
	
	НомераУпаковок.Очистить();
	
	ДанныеУпаковок = XMLЗначение(Тип("ХранилищеЗначения"), ТекстФайла).Получить();
	Если ТипЗнч(ДанныеУпаковок) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеМестДеятельности = Новый Соответствие;
	СоответствиеНоменклатуры = Новый Соответствие;
	
	Для Каждого Строка Из ДанныеУпаковок Цикл
		
		НоваяСтрока = НомераУпаковок.Добавить();
		
		НоваяСтрока.НомерУпаковки = Строка.НомерУпаковки;
		НоваяСтрока.КлючУпаковки = Строка.КлючУпаковки;
		НоваяСтрока.ДатаСтатуса = Строка.ДатаСтатуса;
		НоваяСтрока.НомерГрупповойУпаковки = Строка.НомерГрупповойУпаковки;
		НоваяСтрока.ГрупповаяУпаковка = Строка.ГрупповаяУпаковка;
		НоваяСтрока.ВложеныПотребительскиеУпаковки = Строка.ВложеныПотребительскиеУпаковки;
		
		НоваяСтрока.Статус = Перечисления.СтатусыУпаковокМДЛП[Строка.Статус];
		
		НоваяСтрока.МестоДеятельности = ПолучитьМестоДеятельности(Строка.Идентификатор, СоответствиеМестДеятельности);
		
		НоваяСтрока.Номенклатура = ПолучитьНоменклатуру(Строка, СоответствиеНоменклатуры);
		НоваяСтрока.Характеристика = ПолучитьХаракетристику(НоваяСтрока.Номенклатура, Строка);
		
		НоваяСтрока.ДоляУпаковки = Строка.ДоляУпаковки;
		НоваяСтрока.ДокументРезерва = Строка.ДокументРезерва;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМестоДеятельности(ИдентификаторМестаДеятельности, СоответствиеМестДеятельности)
	
	МестоДеятельности = СоответствиеМестДеятельности.Получить(ИдентификаторМестаДеятельности);
	Если МестоДеятельности <> Неопределено Тогда
		Возврат МестоДеятельности;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОрганизацииМДЛП.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ОрганизацииМДЛП КАК ОрганизацииМДЛП
	|ГДЕ
	|	ОрганизацииМДЛП.СобственнаяОрганизация
	|	И ОрганизацииМДЛП.РегистрационныйНомерУчастника = &ИдентификаторМестаДеятельности
	|	И НЕ ОрганизацииМДЛП.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МестаДеятельностиМДЛП.Ссылка
	|ИЗ
	|	Справочник.ОрганизацииМДЛП КАК ОрганизацииМДЛП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МестаДеятельностиМДЛП КАК МестаДеятельностиМДЛП
	|		ПО ОрганизацииМДЛП.Ссылка = МестаДеятельностиМДЛП.Организация
	|ГДЕ
	|	ОрганизацииМДЛП.СобственнаяОрганизация
	|	И МестаДеятельностиМДЛП.Идентификатор = &ИдентификаторМестаДеятельности
	|	И НЕ ОрганизацииМДЛП.ПометкаУдаления
	|	И НЕ МестаДеятельностиМДЛП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ИдентификаторМестаДеятельности", ИдентификаторМестаДеятельности);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СоответствиеМестДеятельности.Вставить(ИдентификаторМестаДеятельности, Выборка.Ссылка);
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаСервере
Функция ПолучитьНоменклатуру(Строка, СоответствиеНоменклатуры)
	
	Номенклатура = СоответствиеНоменклатуры.Получить(Строка.Номенклатура);
	Если Номенклатура <> Неопределено Тогда
		Возврат Номенклатура;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
		
		НоменклатураСсылка = Справочники.Номенклатура.ПолучитьСсылку(Строка.Номенклатура);
		НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
		
		Если НоменклатураОбъект <> Неопределено Тогда
			СоответствиеНоменклатуры.Вставить(Строка.Номенклатура, НоменклатураСсылка);
			Возврат НоменклатураСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ПолучитьХаракетристику(Номенклатура, Строка)
	
	Если ЗначениеЗаполнено(Строка.Характеристика) Тогда
		
		ХарактеристикаСсылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Строка.Характеристика);
		ХарактеристикаОбъект = ХарактеристикаСсылка.ПолучитьОбъект();
		
		Если ХарактеристикаОбъект <> Неопределено Тогда
			Возврат ХарактеристикаСсылка;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНомераУпаковокСервер()
	
	НаборЗаписей = РегистрыСведений.УпаковкиМДЛП.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ДолиУпаковокМДЛП.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	НомераУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	НомераУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	НомераУпаковок.ДатаСтатуса КАК ДатаСтатуса,
	|	НомераУпаковок.НомерГрупповойУпаковки КАК НомерГрупповойУпаковки,
	|	НомераУпаковок.ГрупповаяУпаковка КАК ГрупповаяУпаковка,
	|	НомераУпаковок.ВложеныПотребительскиеУпаковки КАК ВложеныПотребительскиеУпаковки,
	|	НомераУпаковок.Статус КАК Статус,
	|	НомераУпаковок.МестоДеятельности КАК МестоДеятельности,
	|	НомераУпаковок.Номенклатура КАК Номенклатура,
	|	НомераУпаковок.Характеристика КАК Характеристика,
	|	НомераУпаковок.ДоляУпаковки КАК ДоляУпаковки
	|ПОМЕСТИТЬ втНомераУпаковок
	|ИЗ
	|	&НомераУпаковок КАК НомераУпаковок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНомераУпаковок.НомерУпаковки КАК НомерУпаковки,
	|	втНомераУпаковок.КлючУпаковки КАК КлючУпаковки,
	|	втНомераУпаковок.ДатаСтатуса КАК ДатаСтатуса,
	|	втНомераУпаковок.НомерГрупповойУпаковки КАК НомерГрупповойУпаковки,
	|	втНомераУпаковок.ГрупповаяУпаковка КАК ГрупповаяУпаковка,
	|	втНомераУпаковок.ВложеныПотребительскиеУпаковки КАК ВложеныПотребительскиеУпаковки,
	|	втНомераУпаковок.Статус КАК Статус,
	|	втНомераУпаковок.МестоДеятельности КАК МестоДеятельности,
	|	втНомераУпаковок.Номенклатура КАК Номенклатура,
	|	втНомераУпаковок.Характеристика КАК Характеристика,
	|	УпаковкиМаркируемыхТоваров.Ссылка КАК сУпаковка,
	|	УпаковкиМаркируемыхТоваров.Номенклатура КАК сНоменклатура,
	|	УпаковкиМаркируемыхТоваров.Характеристика КАК сХарактеристика,
	|	втНомераУпаковок.ДоляУпаковки КАК ДоляУпаковки
	|ИЗ
	|	втНомераУпаковок КАК втНомераУпаковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ор_МДЛПУпаковкиМаркируемыхТоваров КАК УпаковкиМаркируемыхТоваров
	|		ПО втНомераУпаковок.НомерУпаковки = УпаковкиМаркируемыхТоваров.НомерУпаковки
	|			И втНомераУпаковок.КлючУпаковки = УпаковкиМаркируемыхТоваров.КлючУпаковки
	|			И (НЕ УпаковкиМаркируемыхТоваров.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("НомераУпаковок", НомераУпаковок.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Пока Выборка.Следующий() Цикл
			
			// Запись регистра
			НоваяЗапись = РегистрыСведений.УпаковкиМДЛП.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
			НоваяЗапись.Записать();
			
			// Запись регистра
			Если ЗначениеЗаполнено(Выборка.ДоляУпаковки) И ТипЗнч(Выборка.ДоляУпаковки) = Тип("Число") Тогда
				НоваяЗапись = РегистрыСведений.ДолиУпаковокМДЛП.СоздатьМенеджерЗаписи();
				НоваяЗапись.НомерУпаковки = Выборка.НомерУпаковки;
				НоваяЗапись.КлючУпаковки = Выборка.КлючУпаковки;
				НоваяЗапись.ДоляУпаковки = Выборка.ДоляУпаковки;
				НоваяЗапись.Записать();
			КонецЕсли;
			
			// Запись справочника
			Если НЕ (ЗначениеЗаполнено(Выборка.Номенклатура) И ЗначениеЗаполнено(Выборка.Характеристика)) Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Выборка.сУпаковка)
				ИЛИ Выборка.сНоменклатура <> Выборка.Номенклатура
				ИЛИ Выборка.сХарактеристика <> Выборка.Характеристика Тогда
				
				Если ЗначениеЗаполнено(Выборка.сУпаковка) Тогда
					УпаковкаМаркируемогоТоваров = Выборка.сУпаковка.ПолучитьОбъект();
				Иначе
					УпаковкаМаркируемогоТоваров = Справочники.ор_МДЛПУпаковкиМаркируемыхТоваров.СоздатьЭлемент();
					УпаковкаМаркируемогоТоваров.НомерУпаковки = Выборка.НомерУпаковки;
				КонецЕсли;
				
				УпаковкаМаркируемогоТоваров.Номенклатура   = Выборка.Номенклатура;
				УпаковкаМаркируемогоТоваров.Характеристика = Выборка.Характеристика;
				
				УпаковкаМаркируемогоТоваров.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗаписиУпаковок()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УпаковкиМДЛП.НомерУпаковки КАК НомерУпаковки
	|ИЗ
	|	РегистрСведений.УпаковкиМДЛП КАК УпаковкиМДЛП
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДолиУпаковокМДЛП.НомерУпаковки
	|ИЗ
	|	РегистрСведений.ДолиУпаковокМДЛП КАК ДолиУпаковокМДЛП";
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

#КонецОбласти
